Revit 2027 API
FabricationRodInfo.GetRodEndPosition Method
 Gets the position of the rod end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetRodEndPosition(
	int rodIndex
)
Public Function GetRodEndPosition (
	rodIndex As Integer
) As XYZ
public:
XYZ^ GetRodEndPosition(
	int rodIndex
)
member GetRodEndPosition :
        rodIndex : int -> XYZ
Parameters
rodIndex Int32
 The index of the rod.
Return Value
XYZ
 The position of the rod end.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace